# Series

In [1]:
import pandas as pd 
import numpy as np 
from pandas import  Series,DataFrame

In [2]:
obj=Series([3,6,9,12])

In [3]:
obj

0     3
1     6
2     9
3    12
dtype: int64

In [4]:
obj.values

array([ 3,  6,  9, 12], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
ww2_cas=Series([8700000,4300000,3000000,2100000,400000], index=['USSR','Germany','China','Japan','USA'])


ww2_cas

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [7]:
ww2_cas['USA']

400000

In [8]:
ww2_cas[ww2_cas>400000]

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
dtype: int64

In [9]:
'USSR' in ww2_cas

True

In [10]:
ww2_dict=ww2_cas.to_dict()

In [11]:
ww2_dict

{'USSR': 8700000,
 'Germany': 4300000,
 'China': 3000000,
 'Japan': 2100000,
 'USA': 400000}

In [12]:
ww2_Series=Series(ww2_dict)

In [13]:
ww2_Series

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [14]:
countries=['China','Germany','Japan','USA','USSR','Argentina']

In [17]:
obj2=Series(ww2_cas,countries)
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
dtype: float64

In [19]:
pd.isnull(obj2)

China        False
Germany      False
Japan        False
USA          False
USSR         False
Argentina     True
dtype: bool

In [20]:
ww2_cas

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [21]:
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
dtype: float64

In [22]:
ww2_Series + obj2

Argentina           NaN
China         6000000.0
Germany       8600000.0
Japan         4200000.0
USA            800000.0
USSR         17400000.0
dtype: float64

In [23]:
obj2.name='World War2 Casualties'

In [24]:
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: World War2 Casualties, dtype: float64

In [25]:
obj2.index.name='Countries'

In [26]:
obj2

Countries
China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: World War2 Casualties, dtype: float64

# DataFrames

In [27]:
import pandas as pd

In [28]:
import numpy as np

In [29]:
from pandas import Series,DataFrame

In [30]:
import webbrowser

In [41]:
website='http://en.wikipedia.org/wiki/NFL_win-loss_records'

In [42]:
webbrowser.open(website)

True

In [43]:
nfl_frame=pd.read_clipboard()

In [44]:
nfl_frame

Empty DataFrame
Columns: ['http://en.wikipedia.org/wiki/NFL_win-loss_records']
Index: []

In [45]:
nfl_frame.columns

Index([''http://en.wikipedia.org/wiki/NFL_win-loss_records''], dtype='object')

In [46]:
DataFrame(nfl_frame,columns=['Team','First Season','Total Games'])

Empty DataFrame
Columns: [Team, First Season, Total Games]
Index: []

In [47]:
DataFrame(nfl_frame,columns=['Team','First Season','Total Games','Stadium'])

Empty DataFrame
Columns: [Team, First Season, Total Games, Stadium]
Index: []

In [48]:
nfl_frame.columns

Index([''http://en.wikipedia.org/wiki/NFL_win-loss_records''], dtype='object')

# ReIndexing

In [104]:
import numpy as np 
import pandas as pd
from pandas import Series,DataFrame
from numpy.random import randn

In [105]:
ser2=Series([1,2,3,4],index=['A','B','C','D'])

In [106]:
ser2

A    1
B    2
C    3
D    4
dtype: int64

In [107]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0)

A    1
B    2
C    3
D    4
E    0
F    0
G    0
dtype: int64

In [108]:
ser3=Series(['USA','Mexico','Canada'],index=[0,5,10])

In [109]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [110]:
ser3.reindex(range(15),method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [111]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [112]:
dframe=DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])

In [113]:
dframe

       col1      col2      col3      col4      col5
A -0.377049 -1.032466  1.113138 -0.717195 -0.569737
B -1.142641  0.470149 -0.983777 -0.043310  0.424446
D -0.820631  0.265987 -0.439216 -1.172646 -0.283990
E  0.307041 -1.456828  1.093519 -0.940642 -0.436571
F  0.738993 -0.960570  0.047432 -1.157479  1.691973

In [114]:
#Notice we forgot 'C' , lets reindex it into dframe
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

In [115]:
#dframe2=(['A','B','C','D','E','F'])

In [116]:
new_columns=['col1','col2','col3','col4','col5','col6']

dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -0.377049 -1.032466  1.113138 -0.717195 -0.569737   NaN
B -1.142641  0.470149 -0.983777 -0.043310  0.424446   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -0.820631  0.265987 -0.439216 -1.172646 -0.283990   NaN
E  0.307041 -1.456828  1.093519 -0.940642 -0.436571   NaN
F  0.738993 -0.960570  0.047432 -1.157479  1.691973   NaN

In [117]:
dframe

       col1      col2      col3      col4      col5
A -0.377049 -1.032466  1.113138 -0.717195 -0.569737
B -1.142641  0.470149 -0.983777 -0.043310  0.424446
D -0.820631  0.265987 -0.439216 -1.172646 -0.283990
E  0.307041 -1.456828  1.093519 -0.940642 -0.436571
F  0.738993 -0.960570  0.047432 -1.157479  1.691973

In [123]:
dframe.ix[['A','B','C','D','E','F'],new_columns]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [136]:
dframe.ix[['A','B','C','D','E','F'],new_columns]

AttributeError: 'DataFrame' object has no attribute 'ix'

# Drop Entry

In [139]:
ser1=Series(np.arange(3),index=['a','b','c'])

ser1

a    0
b    1
c    2
dtype: int32

In [140]:
ser1.drop('b')

a    0
c    2
dtype: int32

In [141]:
dframe1=DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],columns=['pop','size','year'])

In [142]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [143]:
dframe1.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [146]:
dframe1.drop('year',axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

In [147]:
ser1=Series(np.arange(3),index=['A','B','C'])

ser2=ser1*2

In [148]:

ser2

A    0
B    2
C    4
dtype: int32

In [150]:
ser1['B']

1

In [151]:
ser1[1]

1

In [152]:
ser1[0:3]

A    0
B    1
C    2
dtype: int32

In [153]:
ser1[['A','B','C']]

A    0
B    1
C    2
dtype: int32

In [154]:
ser1[ser1>3]

Series([], dtype: int32)

In [155]:
ser1[ser1>3]=10

In [156]:
ser1[ser1>3]

Series([], dtype: int32)

In [157]:
ser1

A    0
B    1
C    2
dtype: int32

In [158]:
dframe=DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','CHI'],columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [159]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
CHI    21
Name: B, dtype: int32

In [160]:
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
CHI  21  24

In [161]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [163]:
dframe>10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [165]:
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
CHI  21  24

In [166]:
ser2=Series([3,4,5,6],index=['A','B','C','D'])

In [167]:
ser1+ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [170]:
#Lets try it with dataframe

dframe1=DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','SF'])

dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [172]:
dframe1+dframe2

      A   B  col1  col2  col3  col4  col5
A   NaN NaN   NaN   NaN   NaN   NaN   NaN
B   NaN NaN   NaN   NaN   NaN   NaN   NaN
C   NaN NaN   NaN   NaN   NaN   NaN   NaN
D   NaN NaN   NaN   NaN   NaN   NaN   NaN
E   NaN NaN   NaN   NaN   NaN   NaN   NaN
F   NaN NaN   NaN   NaN   NaN   NaN   NaN
NYC NaN NaN   NaN   NaN   NaN   NaN   NaN
SF  NaN NaN   NaN   NaN   NaN   NaN   NaN

In [173]:
dframe1.add(dframe2,fill_value=0)

       A    B      col1      col2      col3      col4      col5
A    NaN  NaN -0.377049 -1.032466  1.113138 -0.717195 -0.569737
B    NaN  NaN -1.142641  0.470149 -0.983777 -0.043310  0.424446
C    NaN  NaN       NaN       NaN       NaN       NaN       NaN
D    NaN  NaN -0.820631  0.265987 -0.439216 -1.172646 -0.283990
E    NaN  NaN  0.307041 -1.456828  1.093519 -0.940642 -0.436571
F    NaN  NaN  0.738993 -0.960570  0.047432 -1.157479  1.691973
NYC  0.0  1.0       NaN       NaN       NaN       NaN       NaN
SF   2.0  3.0       NaN       NaN       NaN       NaN       NaN

In [174]:
dframe2

       col1      col2      col3      col4      col5
A -0.377049 -1.032466  1.113138 -0.717195 -0.569737
B -1.142641  0.470149 -0.983777 -0.043310  0.424446
C       NaN       NaN       NaN       NaN       NaN
D -0.820631  0.265987 -0.439216 -1.172646 -0.283990
E  0.307041 -1.456828  1.093519 -0.940642 -0.436571
F  0.738993 -0.960570  0.047432 -1.157479  1.691973

In [176]:
dframe2-ser3

   col1  col2  col3  col4  col5   0   5  10
A   NaN   NaN   NaN   NaN   NaN NaN NaN NaN
B   NaN   NaN   NaN   NaN   NaN NaN NaN NaN
C   NaN   NaN   NaN   NaN   NaN NaN NaN NaN
D   NaN   NaN   NaN   NaN   NaN NaN NaN NaN
E   NaN   NaN   NaN   NaN   NaN NaN NaN NaN
F   NaN   NaN   NaN   NaN   NaN NaN NaN NaN

# Rank and Sort

In [177]:
ser1.sort_index()

A    0
B    1
C    2
dtype: int32

In [183]:
ser2=Series(randn(10))

ser2

0    0.034812
1   -0.244318
2   -0.980538
3   -1.592190
4    0.388269
5   -1.257599
6   -0.049188
7   -0.143477
8   -0.689977
9    0.262241
dtype: float64

In [184]:
ser2.rank()

0     8.0
1     5.0
2     3.0
3     1.0
4    10.0
5     2.0
6     7.0
7     6.0
8     4.0
9     9.0
dtype: float64

In [185]:
ser2.rank()

0     8.0
1     5.0
2     3.0
3     1.0
4    10.0
5     2.0
6     7.0
7     6.0
8     4.0
9     9.0
dtype: float64

# Statistics Summary

In [186]:
import numpy as np 
import pandas as pd 
from pandas import Series,DataFrame

In [187]:
arr=np.array([[1,2,np.nan],[np.nan,3,4]])
dframe1=DataFrame(arr,index=['A','B'],columns=['One','Two','Three'])

dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [188]:
dframe1.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [192]:
dframe1.sum(axis=1)

A    3.0
B    7.0
dtype: float64

In [191]:
dframe1.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [195]:
dframe1.idxmin()

One      A
Two      A
Three    B
dtype: object

In [196]:
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [197]:
dframe1.cumsum()

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [198]:
dframe1.describe()

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [199]:
from IPython.display import YouTubeVideo

In [201]:
YouTubeVideo('https://www.youtube.com/?gl=GB&hl=en-GB')

In [205]:
import pandas.io.data as pdweb

ModuleNotFoundError: No module named 'pandas.io.data'

In [204]:
pip install pandas-datareader

Collecting pandas-datareader
  Downloading pandas_datareader-0.9.0-py3-none-any.whl (107 kB)
Requirement already satisfied: pandas>=0.23 in c:\programdata\anaconda3\lib\site-packages (from pandas-datareader) (1.0.5)
Requirement already satisfied: lxml in c:\programdata\anaconda3\lib\site-packages (from pandas-datareader) (4.5.2)
Requirement already satisfied: requests>=2.19.0 in c:\programdata\anaconda3\lib\site-packages (from pandas-datareader) (2.24.0)
Requirement already satisfied: numpy>=1.13.3 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (1.18.5)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (2.8.1)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pytz>=2017.2 in c:\programdata\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (2020.1)
Requirement already satisfied: certifi>=2017.4.17 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (2020.6.20)
Requirement already satisfied: idna<3,>=2.5 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (2.10)
Requirement already satisfied: chardet<4,>=3.0.2 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (3.0.4)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in c:\programdata\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (1.25.9)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas>=0.23->pandas-datareader) (1.15.0)
Installing collected packages: pandas-datareader
Successfully installed pandas-datareader-0.9.0

In [206]:
from pandas_datareader import data

In [207]:
import datetime

In [209]:
import pandas.io.data

ModuleNotFoundError: No module named 'pandas.io.data'

In [210]:
pip install wheel

Requirement already satisfied: wheel in c:\programdata\anaconda3\lib\site-packages (0.34.2)
Note: you may need to restart the kernel to use updated packages.

In [211]:
pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.0.5)
Requirement already satisfied: numpy>=1.13.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: pytz>=2017.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [212]:
import pandas.io.data

ModuleNotFoundError: No module named 'pandas.io.data'

In [217]:
#Now lets check correlation and covariance on some stock prices!

#Pandas can get info off the web
from pandas_datareader import data,wb

#Set datetime for date input
import datetime

#Get the closing prices

prices = pd.get_data_yahoo(['CVX','XOM','BP'], 
                               start=datetime.datetime(2010, 1, 1), 
                               end=datetime.datetime(2013, 1, 1))['Adj Close']
#Show preview
prices.head()

AttributeError: module 'pandas' has no attribute 'get_data_yahoo'